profiler/tsung_template.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">
    <clients>
        %(clients)s
    </clients>
    <servers>
        %(server)s
    </servers>
    <monitoring>
        %(monitor)s
    </monitoring>
 
    <load>
        <arrivalphase phase="1" duration="5" unit="minute">
            <users interarrival="0.002" unit="second"/>
        </arrivalphase>
    </load>
 
    <sessions>
        <session name='wsgitest' probability='100'  type='ts_http'>
            <for from="0" to="12" incr="1" var="counter">
                <request>
                    %(get)s
                </request>
                <thinktime random='false' value='5'/>
            </for>
        </session>
    </sessions>
</tsung>